perf/seckill.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree><TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="HMDP seckill"><elementProp name="TestPlan.user_defined_variables" elementType="Arguments"/></TestPlan><hashTree>
    <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Unique user tokens"><stringProp name="filename">perf/data/tokens.csv</stringProp><stringProp name="variableNames">token</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="recycle">false</boolProp><boolProp name="stopThread">true</boolProp><stringProp name="shareMode">shareMode.all</stringProp></CSVDataSet><hashTree/>
    <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Seckill burst"><intProp name="ThreadGroup.num_threads">${__P(threads,100)}</intProp><intProp name="ThreadGroup.ramp_time">${__P(ramp,10)}</intProp><longProp name="ThreadGroup.duration">0</longProp><longProp name="ThreadGroup.delay">0</longProp><boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController"><stringProp name="LoopController.loops">${__P(loops,1)}</stringProp><boolProp name="LoopController.continue_forever">false</boolProp></elementProp></ThreadGroup><hashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST seckill"><stringProp name="HTTPSampler.domain">${__P(host,127.0.0.1)}</stringProp><stringProp name="HTTPSampler.port">${__P(port,8080)}</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.path">/voucher-order/seckill/${__P(voucherId,100)}</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><intProp name="HTTPSampler.connect_timeout">3000</intProp><intProp name="HTTPSampler.response_timeout">5000</intProp></HTTPSamplerProxy><hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Headers"><collectionProp name="HeaderManager.headers"><elementProp name="authorization" elementType="Header"><stringProp name="Header.name">authorization</stringProp><stringProp name="Header.value">${token}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="HTTP and business success"><collectionProp name="Asserion.test_strings"><stringProp name="ok">&quot;success&quot;:true</stringProp></collectionProp><stringProp name="Assertion.custom_message">秒杀业务响应失败</stringProp><stringProp name="Assertion.test_field">Assertion.response_data</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">2</intProp></ResponseAssertion><hashTree/>
      </hashTree>
      <SummaryReport guiclass="SummaryReport" testclass="ResultCollector" testname="Summary"><boolProp name="ResultCollector.error_logging">false</boolProp><objProp><name>saveConfig</name><value class="SampleSaveConfiguration"><time>true</time><latency>true</latency><timestamp>true</timestamp><success>true</success><label>true</label><code>true</code><message>true</message><threadName>true</threadName><dataType>true</dataType><bytes>true</bytes><sentBytes>true</sentBytes><grpThreads>true</grpThreads><allThreads>true</allThreads><connectTime>true</connectTime></value></objProp></SummaryReport><hashTree/>
    </hashTree>
  </hashTree></hashTree>
</jmeterTestPlan>